# ******************************************************************************* 
# * Copyright (c) contributors to the Minerva for Modernization project.
# * Licensed under the Apache License, Version 2.0 (the "License");
# * you may not use this file except in compliance with the License.
# * You may obtain a copy of the License at
# * 
# *     http://www.apache.org/licenses/LICENSE-2.0
# * 
# * Unless required by applicable law or agreed to in writing, software
# * distributed under the License is distributed on an "AS IS" BASIS,
# * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# * See the License for the specific language governing permissions and
# * limitations under the License.
# *
# * Contributors:
# *     IBM Corporation - initial implementation
# *******************************************************************************

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

BadMessageKey = \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ad\u30fc "{0}" \u306b\u5bfe\u5fdc\u3059\u308b\u30a8\u30e9\u30fc\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
FormatFailed = \u6b21\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u8a2d\u5b9a\u4e2d\u306b\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f:\n

StartingAnalyzer = Minerva Binary Analyzer \u3092\u958b\u59cb\u3057\u3066\u3044\u307e\u3059
AnalyzingArchive = \u30a2\u30fc\u30ab\u30a4\u30d6 {0} \u3092\u5206\u6790\u3057\u3066\u3044\u307e\u3059\u3002
OutputDirectory = \u51fa\u529b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc: {0}
PackageIncludeList = \u30d1\u30c3\u30b1\u30fc\u30b8\u7d44\u307f\u8fbc\u307f\u30ea\u30b9\u30c8: {0}
PackageExcludeList = \u30d1\u30c3\u30b1\u30fc\u30b8\u9664\u5916\u30ea\u30b9\u30c8: {0}
AgentOutputStream = \u30a8\u30fc\u30b8\u30a7\u30f3\u30c8 OutputStream \u69cb\u6210: {0}\u3002
CallGraphAlgorithm = \u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u30fb\u30d3\u30eb\u30c0\u30fc\u30fb\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0: {0}\u3002

AnalyzingClass = \u30af\u30e9\u30b9 {0} \u3092\u5206\u6790\u3057\u3066\u3044\u307e\u3059\u3002
DuplicateClass = \u91cd\u8907\u3059\u308b\u30af\u30e9\u30b9 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002 \u3053\u306e\u30af\u30e9\u30b9\u306e\u6700\u521d\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u307f\u304c\u5206\u6790\u3055\u308c\u307e\u3059\u3002
SkippedClass = \u30af\u30e9\u30b9 {0} \u304c\u30a2\u30fc\u30ab\u30a4\u30d6\u5185\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u304c\u3001\u5206\u6790\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002

DirectoryCreated = \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc {0} \u304c\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002
WritingFile = \u30d5\u30a1\u30a4\u30eb {0} \u3092\u66f8\u304d\u8fbc\u3093\u3067\u3044\u307e\u3059\u3002

ArchiveDoesNotExist = \u30a2\u30fc\u30ab\u30a4\u30d6 {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
ArchiveEmpty = \u30a2\u30fc\u30ab\u30a4\u30d6 {0} \u306f\u7a7a\u306e\u30d5\u30a1\u30a4\u30eb\u3067\u3059\u3002
ArchiveReadFile = \u30a2\u30fc\u30ab\u30a4\u30d6\u304b\u3089\u30d5\u30a1\u30a4\u30eb {0} \u3092\u8aad\u307f\u53d6\u3063\u3066\u3044\u307e\u3059\u3002
ArchiveReadError = {0} \u30d5\u30a1\u30a4\u30eb\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u3066\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8: {1}
ArchiveCloseError = {0} \u30d5\u30a1\u30a4\u30eb\u3092\u9589\u3058\u3088\u3046\u3068\u3057\u3066\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8: {1}

CallGraphClassHierarchyBuild = \u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u751f\u6210\u306e\u30af\u30e9\u30b9\u968e\u5c64\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059...
CallGraphEndpointCalculation = \u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u751f\u6210\u306e\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3092\u8a08\u7b97\u3057\u3066\u3044\u307e\u3059...
CallGraphBuildInitial = \u6700\u521d\u306e\u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059...
CallGraphBuildFinal = \u6700\u7d42\u52a0\u91cd\u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u304a\u3088\u3073\u6709\u5411\u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059...
CallGraphTempFileWriteWarning = \u30af\u30e9\u30b9 {0} \u306f\u3001\u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30e1\u30e2\u30ea\u30fc\u5185\u3067\u51e6\u7406\u3055\u308c\u307e\u3059\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8: {1}
CallGraphTempFileReadError = \u30af\u30e9\u30b9 {0} \u306e\u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u306e\u8aad\u307f\u53d6\u308a\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8: {1}
CallGraphBuildError = \u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u3001\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8: {0}
CallGraphWriteError = \u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u3092\u30d5\u30a1\u30a4\u30eb {0} \u306b\u66f8\u304d\u8fbc\u3082\u3046\u3068\u3057\u3066\u3001\u4e88\u671f\u3057\u306a\u3044\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8: {1}

CallGraphFileIsNotJAR = \u30d5\u30a1\u30a4\u30eb {0} \u306f JAR \u3067\u306f\u306a\u3044\u305f\u3081\u3001\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u307e\u3059\u3002
CallGraphAddExtraLibToScope = \u4f9d\u5b58\u95a2\u4fc2\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u5206\u6790\u30b9\u30b3\u30fc\u30d7\u306b\u8ffd\u52a0\u3057\u3066\u3044\u307e\u3059: {0}
CallGraphBuildMethodLevel = \u30e1\u30bd\u30c3\u30c9\u30fb\u30ec\u30d9\u30eb\u60c5\u5831\u3092\u4f7f\u7528\u3057\u3066\u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059 ...
CallGraphPopulatingMethodLevel = \u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u306b\u30e1\u30bd\u30c3\u30c9\u30fb\u30ec\u30d9\u30eb\u60c5\u5831\u3092\u53d6\u308a\u8fbc\u307f\u4e2d ...
CallGraphCalculatingWeightMethodLevel = \u30e1\u30bd\u30c3\u30c9\u30fb\u30ec\u30d9\u30eb\u60c5\u5831\u3092\u4f7f\u7528\u3057\u3066\u30b3\u30fc\u30eb\u30fb\u30b0\u30e9\u30d5\u5185\u306e\u63a5\u7d9a\u306e\u91cd\u307f\u3092\u8a08\u7b97\u3057\u3066\u3044\u307e\u3059 ...
